Repository: OpenDeltaE2-Plugins/enigma2-plugin-extensions-epgimport
Catalog: src/EPGImport/locale/*.po
Languages: et, fr, hu, pt

source: Import of epg data will start. This may take a few minutes. Is this ok?
et: Algab epg hankimine See võib kesta mõne minuti Kas see sobib?
fr: L'import des données EPG va commencer. Cela va durer quelques minutes. Êtes-vous d'accord ?
hu: Az EPG adatok importálása megkezdődik. Ez néhány percet igénybe vesz. Folytathatjuk?
pt: A Importação de dados epg vai iniciar. Isto pode levar alguns minutos. Confirma?

source: events
et: saadet
fr: évènements
hu: esemény
pt: eventos

source: Add Channel
et: Lisa kanal
fr: Ajouter une chaîne
hu: Csatorna hozzáadása
pt: Adicionar Canal

source: Add Provider
et: Lisa levitaja
fr: Ajouter un fournisseur
hu: Szolgáltató hozzáadása
pt: Adicionar Operador

source: All services provider
et: Levitaja kõigile kanalitele
fr: Tous les services du fournisseur
hu: Minden szolgáltató
pt: Todos os Operadores de Serviços

source: Also apply "channel id" filtering on custom.channels.xml
fr: Appliquer aussi le filtrage du "channel id" sur le custom.channels.xml

source: Automated EPG Importer
et: Automaatne EPG import
fr: Importation EPG automatique
hu: Automatikus EPG importáló
pt: Importador EPG automatizado

source: Automatic import EPG
et: Hangi EPG automaatselt
fr: Importation EPG automatique
hu: Automatikus EPG importálás
pt: Importação automática de EPG

source: Automatic start time
et: Automaatse käivituse aeg
fr: Heure de démarrage automatique
hu: Automatikus importálás időpontja
pt: Hora de início automático

source: Cancel
et: Tühista
fr: Annuler
hu: Mégsem
pt: Cancelar

source: Channel Selection
et: Kanalivalik
fr: Sélection des chaînes
hu: Csatornaválasztás
pt: Seleção de Canais

source: Choice days for start import
et: Päev EPG hankimiseks
fr: Choisir les jours pour démarrer l’import
hu: Importálások napjai
pt: Escolha de dias para começar a importação

source: Choose the action to perform when the box is in deep standby and the automatic EPG update should normally start.
fr: Choisissez l’action à effectuer lorsque le récepteur est en veille profonde et que la mise à jour automatique de l’EPG doit commencer.

source: Clear
et: Kustuta
fr: Effacer
hu: Alaphelyzet
pt: Limpar

source: Clearing current EPG before import
et: Aktiivse EPG eemaldamine enne importi
fr: Effacer l'EPG actuel avant l'importation
hu: Előző EPG felülírása az újjal
pt: Limpar o EPG atual antes de importar

source: Consider setting "Days Profile"
et: Seadista "päevade profiil"
fr: Considérer le profil « Profil des jours »
hu: Napi profil használata
pt: Considere a configuração de "Perfil de dias"

source: Days Profile
et: Päevade profiil
fr: Profil des jours
hu: Napi profilok
pt: Perfil de dias

source: Define the number of days that you want to get the full EPG data, reducing this number can help you to save memory usage on your box. But you are also limited with the EPG provider available data. You will not have 15 days EPG if it only provide 7 days data.
fr: Définissez le nombre de jours dont vous souhaitez obtenir les données EPG complètes, cela peut vous aider à limiter l’utilisation de la mémoire sur votre récepteur. Mais vous êtes également limité par les données disponibles par le fournisseur d'EPG. Vous n’aurez pas 15 jours d'EPG s'il ne fournit que les données pour 7 jours.

source: Delete all
et: Kustuta kõik
fr: Tout effacer
hu: Összes törlése
pt: Eliminar tudo

source: Delete selected
et: Kustuta valik
fr: Effacer les sélectionner
hu: Kijelöltek törlése
pt: Eliminar selecionados

source: Display a shortcut "EPG import now" in the extension menu. This menu entry will immediately start the EPG update process when selected.
fr: Affichez un raccourci «Importer EPG maintenant » sur l'écran principal de votre récepteur. Cette entrée du menu démarre immédiatement le processus de mise à jour de l'EPG.

source: Display a shortcut "EPG import" in your STB epg menu screen. This allows you to access the configuration.
fr: Affichez un raccourci « EPG import » sur l'écran principal de votre récepteur. Cela vous permet d'accéder à la configuration.

source: EPG Import Configuration
et: Seadistamine
fr: Configuration EPG import
hu: EPG Import beállítások
pt: Configuração de importação EPG

source: EPG Import Log
et: EPG impordi logi
fr: Log EPG Import
hu: EPG Import napló
pt: Log de importação EPG

source: EPG Import Sources
et: EPG impordi allikad
fr: Sources pour EPG Import
hu: EPG Import források
pt: Fontes de importação do EPG

source: EPG Import finished, %d events
et: EPG hankimine lõpetatud, %d saadet
fr: EPG Import terminé, %d évènements
hu: EPG Import befejezve, %d esemény
pt: EPG importação concluída, %d eventos

source: EPG import now
fr: Importer l’EPG maintenant

source: EPGImport Import of epg data is still in progress. Please wait.
et: EPG import Epg hankimine on pooleli. Oota.
fr: EPGImport Plugin L'import des données EPG est encore en cours. Merci de patienter.
hu: EPGImport Az EPG adatok importálása folyamatban van. Kérem, várjon.
pt: EPGImport Importação de dados epg ainda está em andamento. Aguarde.

source: EPGImport Import of epg data will start. This may take a few minutes. Is this ok?
et: EPG import Algab epg hankimine See võib kesta mõne minuti Kas see sobib?
fr: EPGImport Plugin L'import des données EPG va commencer. Cela va durer quelques minutes. Êtes-vous d'accord ?
hu: EPGImport Az EPG adatok importálása megkezdődik. Ez néhány percet igénybe vesz. Folytathatjuk?
pt: EPGImport A Importação de dados epg vai iniciar. Isto pode levar alguns minutos. Confirma?

source: EPGImport Plugin Failed to start:
et: EPGImport Käivitamine nurjus:
fr: EPGImport Plugin Echec du démarrage:
hu: Az EPGImport bővítmény Nem tudott elindulni:
pt: EPGImport Plugin Falha ao iniciar:

source: Filtering: %s Please wait!
fr: Filtrage: %s Merci de patienter!
hu: Szűrés: %s Kérem várjon!

source: Friday
et: Reede
fr: Vendredi
hu: Péntek
pt: Sexta feira

source: Ignore services list
et: Eiratav kanalinimekiri
fr: Liste des services à ignorer
hu: Csatornalista kihagyása
pt: Ignorar a lista de serviços

source: Ignore services list(press OK to save)
et: Eiratav (salvestamiseks vajuta OK)
fr: Liste des services à ignorer (appuyez sur OK pour sauvegarder)
hu: Csatornalista kihagyása (Nyomjon OK-t a mentéshez)
pt: Ignorar a lista de serviços (Premir OK para salvar)

source: Import current source
et: Import valitud allikast
fr: Importer la source actuelle
hu: Jelenlegi forrás importálása
pt: Importar a fonte atual

source: Importing: %s %s events
et: Import: %s %s saadet
fr: Importation: %s %s évènements
hu: Importálás: %s %s esemény
pt: Importação: %s %s eventos

source: Last import:
et: Viimati:
fr: Dernier import:
hu: Utolsó importálás:
pt: Última importação:

source: Last import: %s events
et: Viimati: %s saadet
fr: Dernier import: %s évènements
hu: Utolsó importálás: %s esemény
pt: Última importação: %s eventos

source: Last: %s %s, %d events
et: Viimati: %s %s, %d saadet
fr: Dernier: %s %s, %d évènements
hu: Frissítve: %s %s, %d esemény
pt: Última: %s %s, %d eventos

source: Load EPG
fr: Charger EPG

source: Load EPG only services in bouquets
et: EPG ainult kanalitele lemmiknimekirjades
fr: Charger EPG uniquements pour les favoris
hu: EPG betöltése csak a könyvjelzőkben szereplő csatornákhoz
pt: Carregar EPG sómente em bouquets

source: Load long descriptions up to X days
et: Pikk saatetutvustus X päevaks
fr: Charger les descriptions longues jusqu'à X jours
hu: Hány napra előre töltse be a leírást
pt: Carregar descrições longas de até X dias

source: Manual
et: Käsitsi
fr: Manuel
hu: Manuális

source: Monday
et: Esmaspäev
fr: Lundi
hu: Hétfő
pt: Segunda-feira

source: No active EPG sources found, nothing to do
et: EPG allikad on määramata. Midagi ei saa teha
fr: Aucune source EPG sélectionnée, rien à faire
hu: Nincs aktív EPG forrás, nincs mit tenni
pt: Sem fontes EPG ativas encontradas, nada a fazer

source: Press OK
et: Vajuta OK
fr: Appuyez sur OK
hu: Nyomja meg az OK-t
pt: Prima OK

source: Really delete all list?
et: Kas kustutada kogu nimekiri?
fr: Vraiment effacer toute la liste?
hu: Biztosan törli az összes listát?
pt: Apagar realmente todas as listas?

source: Return to deep standby after import
et: Pärast importi tagasi puhkeseisundisse
fr: Retour à veille profonde après l'importation
hu: Kikapcsolás importálás után
pt: Desligar a STB após a importação

source: Run AutoTimer after import
et: Käivita Autotaimer pärast importi
fr: Exécutez AutoTimer après l'importation
hu: Automatikus időzítő futtatása importálás után
pt: Executar AutoTimer após a importação

source: Saturday
et: Laupäev
fr: Samedi
hu: Szombat
pt: Sábado

source: Save
et: Salvesta
fr: Sauvegarder
hu: Mentés
pt: Guardar

source: Select action
et: Vali tegevus
fr: Choisir une action
hu: Válasszon műveletet
pt: Selecionar ação

source: Select load EPG mode for services.
fr: Sélectionnez la méthode de filtrage des services pour l'EPG.

source: Show "EPG import now" in extensions
et: Kuva "EPG import now" laienduste menüüs
fr: Afficher « Importer l’EPG maintenant » dans le menu extension
hu: EPGImport mutatása a bővítményeknél
pt: Mostrar "Importador de EPG" em extensões

source: Show "EPG import" in epg menu
fr: Afficher « EPG import » dans le menu EPG
pt: Mostrar "EPGImport" no menu EPG

source: Show log
et: Kuva logi
fr: Afficher le log
hu: Naplófájl megjelenítése
pt: Mostrar registo

source: Skip import on restart GUI
et: Ära impordi pärast E2 taaskäivitust
fr: Eviter l'import au redémarrage GUI
hu: Importálás kihagyása a kezelőfelület újraindításakor
pt: Ignorar a importação na reinicialização do GUI

source: Specify in which case the EPG must be automatically updated after the box has booted.
fr: Spécifiez dans quel cas l’EPG doit être automatiquement être mis à jour après le démarrage du récepteur.

source: Specify the time for the automatic EPG update.
fr: Spécifiez l’heure de la mise à jour automatique de l’EPG.

source: Standby at startup
et: Käivitamine ooteseisundist
fr: Démarrer en veille
hu: Készenlét indításkor
pt: Espera na inicialização

source: Start import after booting up
et: Hangi EPG pärast alglaadimist
fr: Charger import après le démarrage
hu: Importálás bootolás után
pt: Iniciar importação depois do arranque

source: Sunday
et: Pühapäev
fr: Dimanche
hu: Vasárnap
pt: Domingo

source: The waked up box will be turned into standby after automatic EPG import wake up.
fr: Votre récepteur sera remis en veille après un réveil automatique pour l'importation automatique de l'EPG.

source: This is for advanced users that are using the channel id filtering feature. If enabled, the filter rules defined into /etc/epgimport/channel_id_filter.conf will also be applied on your /etc/epgimport/custom.channels.xml file.
fr: Ceci est pour les utilisateurs avancés qui utilisent la fonction de filtrage du channel id. Si activé, les règles de filtrages définies dans /etc/epgimport/channel_id_filter.conf seront également appliquées sur votre fichier /etc/epgimport/custom.channels.xml.

source: This will clear the current EPG data in memory before updating the EPG data. This allows you to always have a clean new EPG with the latest EPG data, for example in case of program changes between refresh, otherwise EPG data are cumulative.
fr: Cela permettra d’effacer les données EPG actuelles avant de mettre à jour les données de celui-ci. Cela vous permet d’avoir toujours les données EPG les plus récentes, en cas de changements de programme entre deux importations, sinon les données EPG sont cumulatives.

source: This will turn back waked up box into deep-standby after automatic EPG import.
fr: Votre récepteur qui a été réveillé, sera remis en veille profonde après une importation de l'EPG.

source: Thursday
et: Neljapäev
fr: Jeudi
hu: Csütörtök
pt: Quinta-Feira

source: To save memory you can decide to only load EPG data for the services that you have in your bouquet files.
fr: Pour limiter l'utilisation mémoire, vous pouvez décider de charger les données EPG uniquement pour les services dans vos favoris.

source: Tuesday
et: Teisipäev
fr: Mardi
hu: Kedd
pt: Terça-Feira

source: Wednesday
et: Kolmapäev
fr: Mercredi
hu: Szerda
pt: Quarta-Feira

source: When enabled, it allows you to schedule an automatic EPG update at the given days and time.
fr: Lorsqu’il est activé, il vous permet de planifier une mise à jour EPG automatique aux jours et à l’heure donnés.

source: When in deep standby
et: Puhkeseisundis
fr: Lorsqu'il est en veille profonde
hu: Kikapcsolt állapotban
pt: Quando em Modo de espera

source: When you decide to load the EPG after GUI restart mention if the "days profile" must be take into consideration or not.
fr: Vous pouvez choisir d'importer l'EPG après un redémarrage de l'IGU tout en respectant le "profil des jours" ou pas.

source: When you restart the GUI you can decide to skip or not the EPG data import.
fr: Lorsque vous redémarrez l’IGU, vous pouvez décider de sauter ou non l’importation de données EPG.

source: Write to /tmp/epgimport.log
et: Kirjuta /tmp/epgimport.log faili
fr: Écrire dans /tmp/epgimport.log
hu: Írás ide: /tmp/epgimport.log
pt: Gravar em /tmp/epgimport.log

source: You can select the day(s) when the EPG update must be performed.
fr: Vous pouvez choisir le(s) jour(s) où l'EPG doit être mis à jour.

source: You can start automatically the plugin AutoTimer after the EPG data update to have it refreshing its scheduling after EPG data refresh.
fr: Vous pouvez déclencher automatiquement le plugin AutoTimer après la mise à jour des données EPG pour que celui-ci remette à jour ses programmation après un rafraîchissement des données de l'EPG.

source: You may not use this settings! At least one day a week should be included!
et: Seda seadistust ei saa kasutada! Tuleb valida vähemalt üks päev või nädal!
fr: Vous ne pouvez pas utiliser ces paramètres! Au moins un jour par semaine devrait être inclus!
hu: Valószínűleg nincs szüksége erre a beállításra! Legalább egy napot ki kell választania!
pt: Não deve usar estas configurações! Pelo menos um dia que por semana deve ser incluída!

source: You must restart Enigma2 to load the EPG data, is this OK?
et: EPG laadimiseks tuleb Enigma2 taaskäivitada. Kas see sobib?
fr: Vous devez redémarrer Enigma2 pour lire les données EPG, Êtes-vous d'accord ?
hu: Újra kell indítani az rendszert az EPG adatok betöltéséhez. Folytathatjuk?
pt: Deve reiniciar Enigma2 para carregar os dados EPG, Confirma?

source: all channels
fr: Toutes les chaînes

source: always
et: alati
fr: toujours
hu: mindig
pt: sempre

source: checking service reference(default)
fr: vérification de la référence du service (par défaut)

source: never
et: mitte kunagi
fr: jamais
hu: soha
pt: nunca

source: only IPTV channels
fr: uniquement les chaînes IPTV

source: only automatic boot
et: ainult automaatsel alglaadimisel
fr: seulement au démarrage automatique
hu: csak automatikus boot esetén
pt: só arranque automático

source: only manual boot
et: ainult käsitsi alglaadimisel
fr: seulement au démarrage manuel
hu: csak manuális boot esetén
pt: só arranque manual

source: skip the import
et: ära hangi
fr: passer l'import
hu: importálás kihagyása
pt: ignorar a importação

source: wake up and import
et: käivita ja impordi
fr: réveiller et importer
hu: felébresztés és importálás
pt: acordar e importar

source: Sources
et: Allikad
hu: Források
pt: Fontes
